---

C#Visual BasicVisual C++

Revit 2024 API
---
CurtainSystem..::..RemoveCurtainGrid Method
CurtainSystem Class See Also Send Feedback
---

Remove CurtainGrid from the specified face for the CurtainSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void RemoveCurtainGrid(
    	Reference face
    )

Visual Basic
---

    Public Sub RemoveCurtainGrid ( _
    	face As Reference _
    )

Visual C++
---

    public:
    void RemoveCurtainGrid(
    	Reference^ face
    )

#### Parameters

face
    Type: Autodesk.Revit.DB..::..ReferenceThe face CurtainGrid will be removed from.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input parameter face is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the CurtainGrid cannot be removed from the specified face or regenerate fails. |

# See Also

CurtainSystem Class

Autodesk.Revit.DB Namespace